# Praktikum 1

In [1]:
fruits = ["apple", "banana"]
another_list = ["This is string", 10]

print(fruits)
print(another_list)

combined = (fruits, another_list)
print(combined)

['apple', 'banana']
['This is string', 10]
(['apple', 'banana'], ['This is string', 10])

In [3]:
gabung = fruits + another_list
print(gabung)

['apple', 'banana', 'This is string', 10]

In [7]:
#Add element to a list
fruits = ["apple", "banana"]
fruits.append("durians")
print(fruits)

#atau
fruits = fruits+["strawberry"]
print(fruits)

['apple', 'banana', 'durians']
['apple', 'banana', 'durians', 'strawberry']

In [12]:
#TUPLE
coordinate = (0,6)
colors = ("pink", "purple", "blue")
print(coordinate)
print(colors)
print(coordinate, colors)

(0, 6)
('pink', 'purple', 'blue')
(0, 6) ('pink', 'purple', 'blue')

# Data Integration

In [40]:
import pandas as pd
import numpy as np

In [20]:
## Merging
left = pd.DataFrame({'key':['K0','K1','K2'],
                    'A':['A0','A1','A2'],
                    'B': ['B0','B1','B2']})

right = pd.DataFrame({'key':['K0','K1','K2'],
                    'C':['C0','C1','CC2'],
                    'D': ['D0','D1','D2']})

result1 = pd.merge(left, right, on='key')

In [18]:
print(result1)

  key   A   B    C   D
0  K0  A0  B0   C0  D0
1  K1  A1  B1   C1  D1
2  K2  A2  B2  CC2  D2

In [19]:
result1

  key   A   B    C   D
0  K0  A0  B0   C0  D0
1  K1  A1  B1   C1  D1
2  K2  A2  B2  CC2  D2

In [24]:
## Multiple Key
left = pd.DataFrame({'key1':['K0','K0','K1','K2'],
                     'key2':['K0','K1','K0','K1'],
                    'A':['A0','A1','A2','A3'],
                    'B': ['B0','B1','B2','B3']})

right = pd.DataFrame({'key1':['K0','K1','K1','K2'],
                     'key2':['K0','K0','K0','K0'],
                    'C':['C0','C1','C2','C3'],
                    'D': ['D0','D1','D2','D3']})

result2 = pd.merge(left, right, on=['key1','key2'])
result2

  key1 key2   A   B   C   D
0   K0   K0  A0  B0  C0  D0
1   K1   K0  A2  B2  C1  D1
2   K1   K0  A2  B2  C2  D2

In [ ]:
# Menggabungkan data dalam satu excel
movie.to_csv("hasil_movie.csv")

movie1=pd.read_csv("D:\Data Mining.hasil_movie.csv")
movie2=pd.read_csv("D:\..............csv")

movie_complete=pd.merge(movie1,movie2, on='movie_code')
movie_complete.head()

In [48]:
movie1=pd.read_csv("D:\Data Mining\hasil_movie.csv", sep=";")
movie2 = pd.read_csv("D:\Data Mining\hasil_movie1.csv", sep=";")
movie_complete=pd.merge(movie1,movie2, on='movie_code')
movie_complete.head()

,movie_code,duration_x,poster_x,country_x,budget_x,gross_x,duration_y,poster_y,country_y,budget_y,gross_y
0,1,23,2,USA,4543333,33434,43,2,Europe,323434,43322
1,2,43,4,USA,643444,23434,22,4,USA,434444,44444
2,3,21,3,USA,4342243,54333,55,3,USA,55454,87666
3,4,65,2,Europe,644335,34234,32,2,Europe,534343,54554

In [47]:
movie1

   movie_code  duration  poster country   budget  gross
0           1        23       2     USA  4543333  33434
1           2        43       4     USA   643444  23434
2           3        21       3     USA  4342243  54333
3           4        65       2  Europe   644335  34234

In [57]:
# Menyimpan excell langsung ke file di laptop 
movie_complete.to_csv("D:/Data Mining/moviebaru.csv")